Revit 2027 API
CameraInfo.FarDistance Property
 Distance from eye point to far plane of view frustum along the view direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FarDistance { get; }
Public ReadOnly Property FarDistance As Double
	Get
public:
property double FarDistance {
	double get ();
}
member FarDistance : float with get
Property Value
Double
Remarks
 This property together with NearDistance determines the depth restrictions of a view frustum.
See Also
Reference
CameraInfo Class
Autodesk.Revit.DB Namespace